{
    "pt": {
      "intro-titulo": "Código limpo, objetivo e semântico.",
      "intro-subtitulo": "Soluções eficientes, impulsionando o crescimento.",
      "intro-desc": "Priorizo lógica clara, estrutura organizada e fácil manutenção.",
      "btn-curriculo": "Baixar Currículo",
      "nav-sobre": "Sobre",
      "nav-skills": "Skills",
      "nav-projetos": "Projetos",
      "nav-contato": "Contato",
      "intro-frase-final": "Quase uma obra de arte.",
      "sobre-titulo": "Quem codifica não apenas executa",
      "sobre-subtitulo": "Entende, planeja e transforma.",
      "sobre-intro": "Sou desenvolvedor FullStack com foco em soluções sólidas e bem estruturadas. Domino tanto o front quanto o back-end, e busco sempre entregar código limpo, funcional e sustentável.Do esboço ao deploy — com precisão e propósito.",
      "sobre-texto-1": "Olá! Meu nome é Lucas Fernando, porém todos me chamam de Fernando, tenho 29 anos, e sou casado com a Letícia. Atualmente, estou passando por uma mudança radical na minha trajetória profissional. Depois de atuar nas áreas da saúde e militar, agora estou me dedicando de corpo e alma para me tornar um desenvolvedor FullStack, sempre buscando a excelência em tudo que me proponho a fazer. Acredito muito no poder do trabalho em equipe, sou bastante organizado e tenho disciplina (talvez herança da minha experiência militar).",
      "sobre-texto-2": "Falando um pouco sobre minhas experiências anteriores, trabalhei como Bombeiro Civil e também prestei serviços como Bombeiro Militar em cidades próximas à minha. Tive a oportunidade de realizar trabalhos voluntários em escolas, ensinando sobre a \"Lei Lucas (Lei nº 13.722)\", e fui instrutor em uma escola de formação de Bombeiros Civis. Além disso, trabalhei com supervisão e apoio a alunos e colaboradores em uma escola particular. Essas experiências me ensinaram a lidar com desafios, a gerenciar pressão e, acima de tudo, a manter a calma e a organização em qualquer situação.",
      "sobre-texto-3": "Assim, com a vontade de descobrir novos horizontes, mergulhei no mundo da programação (algo que sempre gostei), comecei meus estudos na DevClub. E aqui estou eu (risos), motivado para transformar obstáculos em soluções inovadoras e, claro, continuar construindo minha jornada no mundo do desenvolvimento!",
      "curiosidades-titulo": "Curiosidades:",
      "curiosidade-1": "Amo plantas.",
      "curiosidade-2": "Tenho um dog pitmonster chamado Dunamis.",
      "curiosidade-3": "Academia: paixão que aviva minha disciplina e foco.",
      "curiosidade-4": "Meu gosto artístico transita do clássico (música e artes visuais) ao soul e blues, com grande apreço pela cultura e história afro.",
      "btn-curriculo": "Baixar Currículo",
      "skills-titulo": "Skills",
      "skills-descricao": "Como desenvolvedor FullStack, a transparência é chave. Aqui, minhas habilidades técnicas, oferecendo uma visão honesta e direta do meu conhecimento em diversas ferramentas.",
      "skills-front-titulo": "Front–End",
      "skills-front-texto": "Desenvolvo aplicações web interativas com JavaScript, estruturando com HTML5 e estilizando com CSS3, criando interfaces modernas e responsivas.",
      "skills-back-titulo": "Back–End",
      "skills-back-texto": "Experiência em desenvolvimento back-end com C# e MySQL, aplicando lógica, consultas e manipulação de dados.",
      "skills-idioma-titulo": "Idiomas",
      "skills-idioma-nivel": "Inglês Intermediário",
      "projeto-titulo": "Se o <span>Louvre</span> fosse <span>tech</span>...",
      "projeto-descricao": "Intrigado pelas minhas habilidades? Sua intuição não falha.<br>Codificar é a minha arte, e cada projeto, uma nova tela.",
      "projeto-nome1": "Biogarden Paisagismo",
      "projeto-legenda1": "Design elegante com foco em natureza e sofisticação.<br>Desenvolvido com",
      "projeto-futuro-titulo": "Em construção...",
      "projeto-futuro-texto": "Mais uma obra-prima está por vir.",
      "footer-assinatura": "Desenvolvido por Fernando Ignacio © 2025"
      },

    "en": {
      "intro-titulo": "Clean, objective and semantic code.",
      "intro-subtitulo": "Efficient solutions, driving growth.",
      "intro-desc": "I prioritize clear logic, organized structure, and easy maintenance.",
      "btn-curriculo": "Download Resume",
      "nav-sobre": "About",
      "nav-skills": "Skills",
      "nav-projetos": "Projects",
      "nav-contato": "Contact",
      "intro-frase-final": "Almost a work of art.",
      "sobre-titulo": "Who codes doesn't just execute",
      "sobre-subtitulo": "they understand, plan and transform.",
      "sobre-intro": "I’m a FullStack developer focused on solid and well-structured solutions. I handle both front-end and back-end, always aiming for clean, functional, and sustainable code. From sketch to deploy — with precision and purpose.",
      "sobre-texto-1": "Hi! My name is Lucas Fernando, but everyone calls me Fernando. I’m 29 years old and married to Letícia. I'm going through a big career change. After working in the health and military fields, I'm now fully focused on becoming a FullStack developer, always aiming for excellence. I truly believe in teamwork, I'm very organized and disciplined (probably from my military background).",
      "sobre-texto-2": "Speaking of my past experiences, I worked as a Civil Firefighter and also served as a Military Firefighter in nearby cities. I volunteered at schools teaching about the 'Lucas Law (Law nº 13.722)', and was an instructor at a Civil Firefighter training school. I also worked supporting students and staff at a private school. These experiences taught me to face challenges, manage pressure, and stay calm and organized in any situation.",
      "sobre-texto-3": "Wanting to explore new horizons, I dove into the world of programming (something I’ve always liked). I started studying at DevClub. And here I am (laughs), motivated to turn challenges into innovative solutions and keep building my journey as a developer!",
      "curiosidades-titulo": "Fun facts:",
      "curiosidade-1": "I love plants.",
      "curiosidade-2": "I have a pitmonster dog named Dunamis.",
      "curiosidade-3": "Gym: a passion that fuels my discipline and focus.",
      "curiosidade-4": "My artistic taste goes from classical (music and visual arts) to soul and blues, with great appreciation for Afro culture and history.",
      "btn-curriculo": "Download Résumé",
      "skills-titulo": "Skills",
      "skills-descricao": "As a FullStack developer, transparency is key. Here are my technical skills, offering an honest and clear view of my experience with different tools.",
      "skills-front-titulo": "Front–End",
      "skills-front-texto": "I build interactive web applications using JavaScript, with HTML5 structure and CSS3 styling, creating modern and responsive interfaces.",
      "skills-back-titulo": "Back–End",
      "skills-back-texto": "Back-end experience with C# and MySQL, applying logic, queries, and data handling.",
      "skills-idioma-titulo": "Languages",
      "skills-idioma-nivel": "Intermediate English",
      "projeto-titulo": "If the <span>Louvre</span> went <span>tech</span>...",
      "projeto-descricao": "Intrigued by my skills? Trust your intuition.<br>Coding is my art, and each project is a new canvas.",
      "projeto-nome1": "Biogarden Landscaping",
      "projeto-legenda1": "Elegant design focused on nature and sophistication.<br>Built with",
      "projeto-futuro-titulo": "Under construction...",
      "projeto-futuro-texto": "Another masterpiece is on the way.",
      "footer-assinatura": "Developed by Fernando Ignacio © 2025"
      
    },

    "es": {
      "intro-titulo": "Código limpio, objetivo y semántico.",
      "intro-subtitulo": "Soluciones eficientes, impulsando el crecimiento.",
      "intro-desc": "Priorizo lógica clara, estructura organizada y fácil mantenimiento.",
      "btn-curriculo": "Descargar CV",
      "nav-sobre": "Sobre mí",
      "nav-skills": "Habilidades",
      "nav-projetos": "Proyectos",
      "nav-contato": "Contacto",
      "intro-frase-final": "Casi una obra de arte.",
      "sobre-titulo": "Quien programa no solo ejecuta",
      "sobre-subtitulo": "entiende, planea y transforma.",
      "sobre-intro": "Soy desarrollador FullStack con enfoque en soluciones sólidas y bien estructuradas. Trabajo tanto en front-end como back-end, y siempre busco entregar código limpio, funcional y sostenible. Del boceto al despliegue — con precisión y propósito.",
      "sobre-texto-1": "¡Hola! Me llamo Lucas Fernando, pero todos me llaman Fernando. Tengo 29 años y estoy casado con Letícia. Actualmente estoy cambiando de carrera. Después de trabajar en salud y en el área militar, ahora estoy enfocado en ser desarrollador FullStack. Creo en el trabajo en equipo, soy organizado y disciplinado (quizás por mi experiencia militar).",
      "sobre-texto-2": "Sobre mis experiencias, trabajé como bombero civil y también en el servicio militar en ciudades cercanas. Hice trabajos voluntarios en escuelas enseñando sobre la 'Ley Lucas (Ley nº 13.722)', y fui instructor en una escuela de formación de bomberos civiles. También trabajé apoyando alumnos y personal en una escuela privada. Estas experiencias me enseñaron a enfrentar desafíos, manejar la presión y mantener la calma en cualquier situación.",
      "sobre-texto-3": "Con ganas de nuevos caminos, empecé a estudiar programación (algo que siempre me gustó). Estudio en DevClub. ¡Y aquí estoy! Motivado para transformar problemas en soluciones y seguir mi camino como desarrollador.",
      "curiosidades-titulo": "Curiosidades:",
      "curiosidade-1": "Me encantan las plantas.",
      "curiosidade-2": "Tengo un perro pitmonster llamado Dunamis.",
      "curiosidade-3": "El gimnasio es una pasión que alimenta mi disciplina y enfoque.",
      "curiosidade-4": "Mi gusto artístico va del clásico (música y artes visuales) al soul y blues, con gran aprecio por la cultura e historia afro.",
      "btn-curriculo": "Descargar Currículum",
      "skills-titulo": "Habilidades",
      "skills-descricao": "Como desarrollador FullStack, la transparencia es importante. Aquí muestro mis habilidades técnicas y lo que sé usar con claridad.",
      "skills-front-titulo": "Front–End",
      "skills-front-texto": "Creo aplicaciones web interactivas con JavaScript, usando HTML5 y CSS3 para hacer interfaces modernas y responsivas.",
      "skills-back-titulo": "Back–End",
      "skills-back-texto": "Tengo experiencia con C# y MySQL en el back-end, usando lógica, consultas y manejo de datos.",
      "skills-idioma-titulo": "Idiomas",
      "skills-idioma-nivel": "Inglés Intermedio",
      "projeto-titulo": "Si el <span>Louvre</span> fuera <span>tech</span>...",
      "projeto-descricao": "¿Te interesan mis habilidades? Tu intuición no falla.<br>Programar es mi arte, y cada proyecto es una nueva obra.",
      "projeto-nome1": "Biogarden Paisajismo",
      "projeto-legenda1": "Diseño elegante con enfoque en la naturaleza y la sofisticación.<br>Hecho con",
      "projeto-futuro-titulo": "En construcción...",
      "projeto-futuro-texto": "Otra obra maestra está por llegar.",
      "footer-assinatura": "Desarrollado por Fernando Ignacio © 2025"
    }
  }
  